IRP/src/Catalogs/AddAttributeAndPropertySets/AddAttributeAndPropertySets.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AddAttributeAndPropertySets</name>
  <predefined>
    <items>
      <name>Catalog_ItemKeys</name>
    </items>
    <items>
      <name>Catalog_Items</name>
    </items>
    <items>
      <name>Catalog_ItemTypes</name>
    </items>
    <items>
      <name>Document_SalesInvoice</name>
    </items>
    <items>
      <name>Catalog_Partners</name>
    </items>
    <items>
      <name>Catalog_ExpenseAndRevenueTypes</name>
    </items>
    <items>
      <name>Catalog_BusinessUnits</name>
    </items>
    <items>
      <name>Catalog_PriceKeys</name>
    </items>
    <items>
      <name>Document_SalesOrder</name>
    </items>
    <items>
      <name>Catalog_ChequeBonds</name>
    </items>
    <items>
      <name>Catalog_Specifications</name>
    </items>
    <items>
      <name>Document_PurchaseInvoice</name>
    </items>
    <items>
      <name>Document_PurchaseOrder</name>
    </items>
    <items>
      <name>Catalog_Agreements</name>
    </items>
    <items>
      <name>Catalog_CashAccounts</name>
    </items>
    <items>
      <name>Catalog_Companies</name>
    </items>
    <items>
      <name>Catalog_Countries</name>
    </items>
    <items>
      <name>Catalog_Currencies</name>
    </items>
    <items>
      <name>Catalog_PriceTypes</name>
    </items>
    <items>
      <name>Catalog_SerialLotNumbers</name>
    </items>
    <items>
      <name>Catalog_Stores</name>
    </items>
    <items>
      <name>Catalog_Taxes</name>
    </items>
    <items>
      <name>Catalog_Units</name>
    </items>
    <items>
      <name>Catalog_Users</name>
    </items>
    <items>
      <name>Document_BankPayment</name>
    </items>
    <items>
      <name>Document_BankReceipt</name>
    </items>
    <items>
      <name>Document_Bundling</name>
    </items>
    <items>
      <name>Document_CashExpense</name>
    </items>
    <items>
      <name>Document_CashPayment</name>
    </items>
    <items>
      <name>Document_CashReceipt</name>
    </items>
    <items>
      <name>Document_CashRevenue</name>
    </items>
    <items>
      <name>Document_CashTransferOrder</name>
    </items>
    <items>
      <name>Document_GoodsReceipt</name>
    </items>
    <items>
      <name>Document_IncomingPaymentOrder</name>
    </items>
    <items>
      <name>Document_InventoryTransfer</name>
    </items>
    <items>
      <name>Document_InventoryTransferOrder</name>
    </items>
    <items>
      <name>Document_Labeling</name>
    </items>
    <items>
      <name>Document_OpeningEntry</name>
    </items>
    <items>
      <name>Document_OutgoingPaymentOrder</name>
    </items>
    <items>
      <name>Document_PhysicalCountByLocation</name>
    </items>
    <items>
      <name>Document_PhysicalInventory</name>
    </items>
    <items>
      <name>Document_PriceList</name>
    </items>
    <items>
      <name>Document_PurchaseReturn</name>
    </items>
    <items>
      <name>Document_PurchaseReturnOrder</name>
    </items>
    <items>
      <name>Document_ReconciliationStatement</name>
    </items>
    <items>
      <name>Document_SalesReturn</name>
    </items>
    <items>
      <name>Document_SalesReturnOrder</name>
    </items>
    <items>
      <name>Document_ShipmentConfirmation</name>
    </items>
    <items>
      <name>Document_StockAdjustmentAsSurplus</name>
    </items>
    <items>
      <name>Document_StockAdjustmentAsWriteOff</name>
    </items>
    <items>
      <name>Document_Unbundling</name>
    </items>
    <items>
      <name>Catalog_Files</name>
    </items>
    <items>
      <name>Document_RetailSalesReceipt</name>
    </items>
    <items>
      <name>Catalog_PaymentTerminals</name>
    </items>
    <items>
      <name>Document_RetailReturnReceipt</name>
    </items>
    <items>
      <name>Catalog_BankTerms</name>
    </items>
    <items>
      <name>Catalog_RetailCustomers</name>
    </items>
    <items>
      <name>Document_CashStatement</name>
    </items>
    <items>
      <name>Catalog_CashStatementStatuses</name>
    </items>
    <items>
      <name>Document_CreditNote</name>
    </items>
    <items>
      <name>Document_DebitNote</name>
    </items>
    <items>
      <name>Catalog_Workstations</name>
    </items>
    <items>
      <name>Catalog_Hardware</name>
    </items>
    <items>
      <name>Catalog_ItemSegments</name>
    </items>
    <items>
      <name>Catalog_PartnerSegments</name>
    </items>
    <items>
      <name>Catalog_PaymentTypes</name>
    </items>
    <items>
      <name>Catalog_SpecialOfferRules</name>
    </items>
    <items>
      <name>Catalog_SpecialOffers</name>
    </items>
    <items>
      <name>Catalog_SpecialOfferTypes</name>
    </items>
    <items>
      <name>Catalog_TaxRates</name>
    </items>
    <items>
      <name>Catalog_UserGroups</name>
    </items>
    <items>
      <name>Document_InternalSupplyRequest</name>
    </items>
    <items>
      <name>Catalog_PartnersBankAccounts</name>
    </items>
    <items>
      <name>Catalog_LockDataModificationReasons</name>
    </items>
    <items>
      <name>Document_ItemStockAdjustment</name>
    </items>
    <items>
      <name>Document_ManualRegisterEntry</name>
    </items>
    <items>
      <name>Document_SalesOrderClosing</name>
    </items>
    <items>
      <name>Document_PlannedReceiptReservation</name>
    </items>
    <items>
      <name>Document_PurchaseOrderClosing</name>
    </items>
    <items>
      <name>Catalog_PartnerItems</name>
    </items>
    <items>
      <name>Document_JournalEntry</name>
    </items>
    <items>
      <name>Catalog_LedgerTypes</name>
    </items>
    <items>
      <name>Document_MoneyTransfer</name>
    </items>
    <items>
      <name>Catalog_AccessGroups</name>
    </items>
    <items>
      <name>Catalog_AccessProfiles</name>
    </items>
    <items>
      <name>Catalog_AccountingOperations</name>
    </items>
    <items>
      <name>Catalog_CancelReturnReasons</name>
    </items>
    <items>
      <name>Catalog_EquipmentDrivers</name>
    </items>
    <items>
      <name>Catalog_ExternalDataProc</name>
    </items>
    <items>
      <name>Catalog_FileStoragesInfo</name>
    </items>
    <items>
      <name>Catalog_FileStorageVolumes</name>
    </items>
    <items>
      <name>Catalog_IntegrationSettings</name>
    </items>
    <items>
      <name>Catalog_InterfaceGroups</name>
    </items>
    <items>
      <name>Catalog_LegalNameContracts</name>
    </items>
    <items>
      <name>Catalog_ObjectStatuses</name>
    </items>
    <items>
      <name>Catalog_PaymentSchedules</name>
    </items>
    <items>
      <name>Catalog_PlanningPeriods</name>
    </items>
    <items>
      <name>Catalog_TaxAnalytics</name>
    </items>
    <items>
      <name>Catalog_UnitsOfMeasurement</name>
    </items>
    <items>
      <name>Catalog_LedgerTypeVariants</name>
    </items>
    <items>
      <name>Document_ChequeBondTransaction</name>
    </items>
    <items>
      <name>Document_ConsolidatedRetailSales</name>
    </items>
    <items>
      <name>Document_WorkOrder</name>
    </items>
    <items>
      <name>Document_WorkOrderClosing</name>
    </items>
    <items>
      <name>Catalog_BillOfMaterials</name>
    </items>
    <items>
      <name>Document_WorkSheet</name>
    </items>
    <items>
      <name>Catalog_FillingTemplates</name>
    </items>
    <items>
      <name>Document_ProductionPlanning</name>
    </items>
    <items>
      <name>Document_ProductionPlanningCorrection</name>
    </items>
    <items>
      <name>Document_ProductionPlanningClosing</name>
    </items>
    <items>
      <name>Document_Production</name>
    </items>
    <items>
      <name>Document_SalesReportFromTradeAgent</name>
    </items>
    <items>
      <name>Document_SalesReportToConsignor</name>
    </items>
    <items>
      <name>Catalog_SourceOfOrigins</name>
    </items>
    <items>
      <name>Document_EmployeeCashAdvance</name>
    </items>
    <items>
      <name>Document_ProductionCostsAllocation</name>
    </items>
    <items>
      <name>Document_Payroll</name>
    </items>
    <items>
      <name>Catalog_AccrualAndDeductionTypes</name>
    </items>
    <items>
      <name>Catalog_EmployeePositions</name>
    </items>
    <items>
      <name>Document_TimeSheet</name>
    </items>
    <items>
      <name>Catalog_Addresses</name>
    </items>
    <items>
      <name>Catalog_Vehicles</name>
    </items>
    <items>
      <name>Catalog_VehicleTypes</name>
    </items>
    <items>
      <name>Document_RetailShipmentConfirmation</name>
    </items>
    <items>
      <name>Document_RetailGoodsReceipt</name>
    </items>
    <items>
      <name>Catalog_FixedAssets</name>
    </items>
    <items>
      <name>Catalog_DepreciationSchedules</name>
    </items>
    <items>
      <name>Catalog_FixedAssetsLedgerTypes</name>
    </items>
    <items>
      <name>Document_CommissioningOfFixedAsset</name>
    </items>
    <items>
      <name>Document_DecommissioningOfFixedAsset</name>
    </items>
    <items>
      <name>Document_FixedAssetTransfer</name>
    </items>
    <items>
      <name>Document_ModernizationOfFixedAsset</name>
    </items>
    <items>
      <name>Document_EmployeeHiring</name>
    </items>
    <items>
      <name>Document_EmployeeTransfer</name>
    </items>
    <items>
      <name>Document_EmployeeFiring</name>
    </items>
    <items>
      <name>Document_EmployeeVacation</name>
    </items>
    <items>
      <name>Document_EmployeeSickLeave</name>
    </items>
    <items>
      <name>Document_AdditionalAccrual</name>
    </items>
    <items>
      <name>Document_AdditionalDeduction</name>
    </items>
    <items>
      <name>Catalog_EmployeeSchedule</name>
    </items>
    <items>
      <name>Document_VisitorCounter</name>
    </items>
    <items>
      <name>Document_RetailReceiptCorrection</name>
    </items>
    <items>
      <name>Catalog_Projects</name>
    </items>
    <items>
      <name>Document_DebitCreditNote</name>
    </items>
    <items>
      <name>Catalog_AgingPeriods</name>
    </items>
    <items>
      <name>Catalog_Incoterms</name>
    </items>
    <items>
      <name>Catalog_SalaryCalculationType</name>
    </items>
    <items>
      <name>Catalog_AttachedDocumentSettings</name>
    </items>
    <items>
      <name>Document_ExpenseAccruals</name>
    </items>
    <items>
      <name>Document_RevenueAccruals</name>
    </items>
    <items>
      <name>Document_TaxesOperation</name>
    </items>
    <items>
      <name>Catalog_ExtDimensions</name>
    </items>
    <items>
      <name>Document_ExternalAccountingOperation</name>
    </items>
    <items>
      <name>Catalog_TaxExemptionReasons</name>
    </items>
    <items>
      <name>Catalog_Cities</name>
    </items>
    <items>
      <name>Document_Issue</name>
    </items>
    <items>
      <name>Document_ELedgerRegistry</name>
    </items>
  </predefined>
  <tabularSections>
    <name>Attributes</name>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Condition</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>IsConditionSet</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>InterfaceGroup</name>
      <comment>Name of group for attribute</comment>
      <type>
        <types>CatalogRef.InterfaceGroups</types>
      </type>
    </attributes>
    <attributes>
      <name>Required</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ShowInHTML</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Collection</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>DefaultName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PathForTag</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Properties</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Condition</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>IsConditionSet</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ShowInHTML</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Collection</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>DefaultName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ExtensionAttributes</name>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Condition</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>IsConditionSet</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>InterfaceGroup</name>
      <comment>Name of group for attribute</comment>
      <type>
        <types>CatalogRef.InterfaceGroups</types>
      </type>
    </attributes>
    <attributes>
      <name>Required</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ShowInHTML</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Show</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/AddAttributeAndPropertySets/Forms/ItemForm/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	LocalizationEvents.CreateMainFormItemDescription(ThisObject, "GroupDescriptions");
	
	Items.AttributesInterfaceGroup.Visible =
		Object.Ref = PredefinedValue("Catalog.AddAttributeAndPropertySets.Catalog_Items")
		Or Object.Ref = PredefinedValue("Catalog.AddAttributeAndPropertySets.Catalog_Partners");
	
	IsCatalog_ItemKeys =
		Object.Ref = PredefinedValue("Catalog.AddAttributeAndPropertySets.Catalog_ItemKeys")
		Or Object.Ref = PredefinedValue("Catalog.AddAttributeAndPropertySets.Catalog_PriceKeys");
	
	Items.GroupAttributesItemKeys.Visible = IsCatalog_ItemKeys;
	Items.GroupAttributes.Visible = Not IsCatalog_ItemKeys;
	
	If IsCatalog_ItemKeys Then
		OnlyAffectPricing = Object.Ref = PredefinedValue("Catalog.AddAttributeAndPropertySets.Catalog_PriceKeys");
		FillAttributesTree(GetItemTypesTree(), ThisObject.AttributesTree, OnlyAffectPricing);
	EndIf;
	ExtensionServer.AddAtributesFromExtensions(ThisObject, Object.Ref, Items.Pages);

EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source, AddInfo = Undefined) Export
	If EventName = "UpdateAddAttributeAndPropertySets" Then
		UpdateAttributesTree();
	EndIf;
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	If Not (CurrentObject.Ref = PredefinedValue("Catalog.AddAttributeAndPropertySets.Catalog_Items")
			Or CurrentObject.Ref = PredefinedValue("Catalog.AddAttributeAndPropertySets.Catalog_Partners")) Then
		For Each Row In CurrentObject.Attributes Do
			Row.InterfaceGroup = Undefined;
		EndDo;
	EndIf;
	For Each Row In Object.Attributes Do
		If Not IsBlankString(Row.ConditionData) Then
			FilterRow = New Structure("Attribute", Row.Attribute);
			CurrentObjectRows = CurrentObject.Attributes.FindRows(FilterRow);
			CurrentObjectRow = CurrentObjectRows[0];
			ConditionData = CommonFunctionsServer.DeserializeXMLUseXDTO(Row.ConditionData);
			CurrentObjectRow.Condition = New ValueStorage(ConditionData, New Deflation(9));
			Row.ConditionData = "";
		EndIf;
	EndDo;
	For Each Row In Object.Properties Do
		If Not IsBlankString(Row.ConditionData) Then
			FilterRow = New Structure("Property", Row.Property);
			CurrentObjectRows = CurrentObject.Properties.FindRows(FilterRow);
			CurrentObjectRow = CurrentObjectRows[0];
			ConditionData = CommonFunctionsServer.DeserializeXMLUseXDTO(Row.ConditionData);
			CurrentObjectRow.Condition = New ValueStorage(ConditionData, New Deflation(9));
			Row.ConditionData = "";
		EndIf;
	EndDo;
EndProcedure

&AtClient
Procedure AfterWrite(WriteParameters)
	Notify("UpdateAddAttributeAndPropertySets", New Structure(), ThisObject);
EndProcedure

#EndRegion

#Region FormTableItemsEventHandlers

&AtClient
Procedure AttributesTreeOnActivateRow(Item)
	CurrentData = Items.AttributesTree.CurrentData;
	Items.EditItemType.Enabled =
		CurrentData <> Undefined
		And ValueIsFilled(CurrentData.ItemType)
		And Not ServiceSystemServer.GetObjectAttribute(CurrentData.ItemType, "IsFolder");
	
	Items.DeleteItemType.Enabled =
		CurrentData <> Undefined
		And ValueIsFilled(CurrentData.ItemType)
		And ValueIsFilled(CurrentData.Attribute)
		And Not ServiceSystemServer.GetObjectAttribute(CurrentData.ItemType, "IsFolder");
EndProcedure

&AtClient
Procedure AttributesBeforeAddRow(Item, Cancel, Clone, Parent, IsFolder, Parameter)
	If Clone Then
		Cancel = True;
		CurrentData = Items.Attributes.CurrentData;
		If Not CopiedAttribute.IsEmpty()
			Or Not CurrentData.IsConditionSet Then
			Return;
		EndIf;		
		NewRow = Object.Attributes.Add();
		FillPropertyValues(NewRow, CurrentData);
		NewRow.Unprocessed = True;
		CopiedAttribute = Items.Attributes.CurrentData.Attribute;
		Items.Attributes.CurrentRow = NewRow.GetID();
		AttachIdleHandler("CopyAttributesRow", 0.1, True);
		Items.Attributes.ChangeRow();		
	EndIf;
EndProcedure

&AtClient
Procedure PropertiesBeforeAddRow(Item, Cancel, Clone, Parent, IsFolder, Parameter)
	If Clone Then
		Cancel = True;
		CurrentData = Items.Properties.CurrentData;
		If Not CopiedAttribute.IsEmpty()
			Or Not CurrentData.IsConditionSet Then
			Return;
		EndIf;		
		NewRow = Object.Properties.Add();
		FillPropertyValues(NewRow, CurrentData);
		NewRow.Unprocessed = True;
		CopiedAttribute = Items.Properties.CurrentData.Property;
		Items.Properties.CurrentRow = NewRow.GetID();
		AttachIdleHandler("CopyPropertiesRow", 0.1, True);
		Items.Properties.ChangeRow();
	EndIf;
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

&AtClient
Procedure SetConditionAttribute(Command)
	SetCondition("Attributes", "Attribute");
EndProcedure

&AtClient
Procedure SetConditionProperty(Command)
	SetCondition("Properties", "Property");
EndProcedure

&AtClient
Procedure EditItemType(Command)
	CurrentData = Items.AttributesTree.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;
	OpenArgs = New Structure();
	OpenArgs.Insert("Key", CurrentData.ItemType);
	If ServiceSystemServer.GetObjectAttribute(OpenArgs.Key, "IsFolder") Then
		OpenFormName = "Catalog.ItemTypes.Form.GroupForm";
	Else
		OpenFormName = "Catalog.ItemTypes.Form.ItemForm";
	EndIf;
	OpenForm(OpenFormName, OpenArgs, ThisObject);
EndProcedure

&AtClient
Procedure DeleteItemType(Command)
	CurrentData = Items.AttributesTree.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;
	
	If ValueIsFilled(CurrentData.ItemType)
		And ValueIsFilled(CurrentData.Attribute) Then
		
		DeleteItemTypeAtServer(CurrentData.ItemType, CurrentData.Attribute);
		UpdateAttributesTree();
	EndIf;
EndProcedure

#EndRegion

#Region Private

&AtClient
Procedure DescriptionOpening(Item, StandardProcessing) Export
	LocalizationClient.DescriptionOpening(Object, ThisObject, Item, StandardProcessing);
EndProcedure

&AtServer
Function GetItemTypesTree()
	Query = New Query();
	Query.Text =
		"SELECT
		|	ItemTypes.Ref AS ItemType,
		|	ItemTypes.IsFolder AS isFolder
		|FROM
		|	Catalog.ItemTypes AS ItemTypes
		|WHERE
		|	NOT ItemTypes.DeletionMark
		|AUTOORDER";
	
	QueryResult = Query.Execute();
	Return QueryResult.Unload(QueryResultIteration.ByGroupsWithHierarchy);
EndFunction

&AtServer
Procedure FillAttributesTree(ItemTypesTree, AttributesTree, OnlyAffectPricing)
	For Each ItemTypesRow In ItemTypesTree.Rows Do
		NewItemTypeRow = AttributesTree.GetItems().Add();
		NewItemTypeRow.Picture = ?(ItemTypesRow.isFolder, 0, 3);
		NewItemTypeRow.ItemType = ItemTypesRow.ItemType;
		NewItemTypeRow.Presentation = String(ItemTypesRow.ItemType);
		If Not ItemTypesRow.IsFolder Then
			For Each AttributeRow In ItemTypesRow.ItemType.AvailableAttributes Do
				If OnlyAffectPricing And Not AttributeRow.AffectPricing Then
					Continue;
				EndIf;
				NewAttributeRow = NewItemTypeRow.GetItems().Add();
				NewAttributeRow.Picture = 4;
				NewAttributeRow.Attribute = AttributeRow.Attribute;
				NewAttributeRow.ItemType = ItemTypesRow.ItemType;
				NewAttributeRow.Presentation = String(AttributeRow.Attribute);
			EndDo;
		EndIf;
		FillAttributesTree(ItemTypesRow, NewItemTypeRow, OnlyAffectPricing);
	EndDo;
EndProcedure

&AtServerNoContext
Procedure DeleteItemTypeAtServer(ItemType, Attribute)
	Catalogs.ItemTypes.DeleteAvailableAttribute(ItemType, Attribute);
EndProcedure

&AtClient
Procedure UpdateAttributesTree()
	UpdateAttributesTreeAtServer();
	ExpandTree(ThisObject.AttributesTree, ThisObject.AttributesTree.GetItems());
EndProcedure

&AtServer
Procedure UpdateAttributesTreeAtServer()
	ThisObject.AttributesTree.GetItems().Clear();
	OnlyAffectPricing = Object.Ref = PredefinedValue("Catalog.AddAttributeAndPropertySets.Catalog_PriceKeys");
	FillAttributesTree(GetItemTypesTree(), ThisObject.AttributesTree, OnlyAffectPricing);
EndProcedure

&AtClient
Procedure ExpandTree(Tree, TreeRows)
	For Each ItemTreeRows In TreeRows Do
		ThisObject.Items.AttributesTree.Expand(ItemTreeRows.GetID());
		ExpandTree(Tree, ItemTreeRows.GetItems());
	EndDo;
EndProcedure

&AtClient
Procedure SetCondition(TableName, ColumnName, AddInfo = Undefined)
	If AddInfo = Undefined Then
		AddInfo = New Structure();
	EndIf;
	AddInfo.Insert("TableName", TableName);
	AddInfo.Insert("ColumnName", ColumnName);
	
	If Not ValueIsFilled(Object.Ref) Or ThisObject.Modified Then
		QuestionToUserNotify = New NotifyDescription("SetConditionNotify", ThisObject, AddInfo);
		ShowQueryBox(QuestionToUserNotify, R().QuestionToUser_001, QuestionDialogMode.YesNo);
	Else
		SetConditionNotify(DialogReturnCode.Yes, AddInfo);
	EndIf;
EndProcedure

&AtClient
Procedure SetConditionNotify(Result, AddInfo = Undefined) Export
	If Result = DialogReturnCode.Yes And Write() Then
		CurrentRow = Items[AddInfo.TableName].CurrentData;
		If CurrentRow = Undefined Then
			Return;
		EndIf;
		
		AddInfo.Insert("Element", CurrentRow[AddInfo.ColumnName]);
		
		Notify = New NotifyDescription("OnFinishEditFilter", ThisObject, AddInfo);
		OpeningParameters = New Structure();
		OpeningParameters.Insert("SavedSettings", GetSettings(CurrentRow[AddInfo.ColumnName], AddInfo));
		OpeningParameters.Insert("Ref", Object.Ref);
		OpenForm("Catalog.AddAttributeAndPropertySets.Form.EditCondition", OpeningParameters, ThisObject, , , , Notify);
	EndIf;
EndProcedure

&AtClient
Procedure OnFinishEditFilter(Result, AddInfo = Undefined) Export
	If TypeOf(Result) = Type("Structure") Then
		SaveSettings(AddInfo.Element, Result.Settings, AddInfo);
	EndIf;
EndProcedure

&AtServer
Function GetSettings(Element, AddInfo = Undefined)
	Filter = New Structure(AddInfo.ColumnName, Element);
	CatalogObject = Object.Ref.GetObject();
	ArrayOfRows = CatalogObject[AddInfo.TableName].FindRows(Filter);
	If ArrayOfRows.Count() Then
		Return ArrayOfRows[0].Condition.Get();
	Else
		Return Undefined;
	EndIf;
EndFunction

&AtServer
Procedure SaveSettings(Element, Settings, AddInfo = Undefined)
	Filter = New Structure(AddInfo.ColumnName, Element);
	CatalogObject = Object.Ref.GetObject();
	ArrayOfRows = CatalogObject[AddInfo.TableName].FindRows(Filter);
	For Each Row In ArrayOfRows Do
		
		SettingsIsSet = False;
		If Settings <> Undefined Then
			For Each FilterItem In Settings.Filter.Items Do
				If FilterItem.Use Then
					SettingsIsSet = True;
					Break;
				EndIf;
			EndDo;
		EndIf;
		
		If SettingsIsSet Then
			Row.Condition = New ValueStorage(Settings);
			Row.IsConditionSet = 1;
		Else
			Row.Condition = Undefined;
			Row.IsConditionSet = 0;
		EndIf;
		
	EndDo;
	CatalogObject.Write();
	ThisObject.Read();
EndProcedure

&AtClient
Procedure CopyAttributesRow()
	If CopiedAttribute.IsEmpty() Then
		Return;
	EndIf;
	AddInfo = New Structure();
	AddInfo.Insert("TableName", "Attributes");
	AddInfo.Insert("ColumnName", "Attribute");
	CopyAttributesPropertiesRowAtServer(AddInfo);
EndProcedure

&AtClient
Procedure CopyPropertiesRow()
	If CopiedAttribute.IsEmpty() Then
		Return;
	EndIf;
	AddInfo = New Structure();
	AddInfo.Insert("TableName", "Properties");
	AddInfo.Insert("ColumnName", "Property");
	CopyAttributesPropertiesRowAtServer(AddInfo);
EndProcedure

&AtServer
Procedure CopyAttributesPropertiesRowAtServer(AddInfo)
	SourceFilter = New Structure;
	SourceFilter.Insert(AddInfo.ColumnName, CopiedAttribute);
	SourceFilter.Insert("Unprocessed", False);	
	FoundSourceRows = Object[AddInfo.TableName].FindRows(SourceFilter);
	
	DestinationFilter = New Structure;
	DestinationFilter.Insert(AddInfo.ColumnName, CopiedAttribute);
	DestinationFilter.Insert("Unprocessed", True);	
	FoundDestinationRows = Object[AddInfo.TableName].FindRows(DestinationFilter);
	
	If FoundSourceRows.Count()
		And FoundDestinationRows.Count() Then
		DestinationRow = FoundDestinationRows[0];
		SourceRow = FoundSourceRows[0];
		If IsBlankString(SourceRow.ConditionData) Then			
			ConditionData = GetSettings(SourceRow[AddInfo.ColumnName], AddInfo);
			DestinationRow.ConditionData = CommonFunctionsServer.SerializeXMLUseXDTO(ConditionData);
		Else
			DestinationRow.ConditionData = SourceRow.ConditionData;
		EndIf;
		DestinationRow.Unprocessed = False;
	EndIf;
	
	CopiedAttribute = ChartsOfCharacteristicTypes.AddAttributeAndProperty.EmptyRef();	
EndProcedure

#EndRegion
